package project02;

public class whateat1 {

	// 저녁메뉴 추천 받기 
	// 대분류를 입력하면 중분류, 나온 중분류 중에서 입력하면 , 소분류 나옴
	
	// 8 대분류 = 식사스타일
	// 1자주 먹는 식사, 2양 많은 식사, 3질 좋은 식사, 4가성비 좋은 식사,
	// 5집에 밥과 같이 식사, 6새로 생긴 식사, 7포장 받아올 식사, 8아플 때 식사
	
	// 중분류 = 식사종류
	// 1-라면, 볶음밥, 치킨, 우동, 라멘, 편의점도시락, 토스트, 
	// 2-볶음밥, 피자, 족발, 보쌈, 수육, 돈가스, 파스타, 감자탕, 찜닭, 짜장, 짬뽕, 탕수육세트,
	// 3-닭가슴살볶음밥, 간장계란밥, 샐러드, 건강볶음밥, 초밥, 회,  
	// 4-김밥, 도시락, 칼국수, 국수, 부대찌개, 햄버거, 
	// 5-미역국, 선지국, 아구찜, 모듬전, 반찬, 닭발,  
	// 6-대만식토스트, 유행하는빵, 유부초밥세트, 
	// 7-토스트, 홍루이젠, 멕시코음식, 타코야끼, 와플, 케이크, 
	//		부대찌개, 닭강정, 편육, 떡볶이, 순대, 어묵, 샌드위치, 
	// 8-죽, 간장계란밥, 누룽지, 
	
	// 소분류 = 세부적인 식사브랜드
//	 라면 - 안성탕면, 신라면, 너구리, 비빔면, 짜파게티, 
//	 볶음밥 - 참치마요, 치킨마요, 
//	 우동 - 일반우동, 어묵우동, 김치우동, 
//	 라멘 - 미소라멘, 쇼유라멘, 돈코츠라멘, 츠케멘, 
//	 편의점도시락 -
//	 토스트 - 
//	 피자 - 
//	 족발 - 
//	 보쌈 - 
//	 수육 
//	돈가스 -
//	파스타 -
//	감자탕 -
//	찜닭 -
//	짜장 -
//	짬뽕 -
//	탕수육세트 -
//	닭가슴살볶음 -
//	간장계란밥 -
//	샐러드 -
//	건강볶음밥 -
//	초밥 -
//	회 -
//	김밥 -
//	도시락 -
//	칼국수 -
//	국수 -
//	부대찌개 -
//	햄버거 -
//	미역국 -
//	선지국 -
//	아구찜 -
//	모듬전 -
//	반찬 -
//	닭발 -
//	대만식토스트 -
//	유행하는빵 -
//	유부초밥세트 -
//	토스트 -
//	홍루이젠 -
//	멕시코음식 -
//	타코야끼 -
//	와플 -
//	케이크 -
//	부대찌개 -
//	닭강정 -
//	편육 -
//	떡볶이 -
//	순대 -
//	어묵 -
//	샌드위치 -
//	죽 -
//	간장계란밥 -
//	누룽지 -
	
	
	
	
	
}
